nilava/pixelbar/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# The SuperMini has no USB-serial bridge: the console and the flashing port are
# the C3's own USB Serial/JTAG. Keeping this on is also what frees GPIO20/21
# (UART0) for the encoder.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_FREERTOS_HZ=1000

# Nothing in this project throws; leaving exceptions off keeps the binary small.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
